#include <stdio.h>

//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
////////////////////나머지를 구하는 문제 메인에서/////////////
///////////////////뽑을 때도 한번 나눠줘야되는 경우///////////
//////////////////////////////////////////////////////////////
/////////////////디피를 재귀로 짰을떄 스택오버플로우//////////
//////////////////생기는 경우/////////////////////////////////
//////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////
#define DIV 9901

int N;
int cache[100000][3];
//count
// 0 그 줄에 사자가 없는것
// 1 그 줄에 사자가 왼쪽
// 2 그 줄에 사자가 오른쪽

void init()
{
	int i,j,k;

	cache[0][0] = 1;
	cache[0][1] = 1;
	cache[0][2] = 1;
}
int process2(int n)
{
	int i;
	for (i = 1; i < N; i++)
	{
		cache[i][0] = cache[i - 1][0] + cache[i - 1][1] + cache[i - 1][2];
		cache[i][0] = cache[i][0] % DIV;
		cache[i][1] = cache[i - 1][0] + cache[i - 1][2];
		cache[i][1] = cache[i][1] % DIV;
		cache[i][2] = cache[i - 1][0] + cache[i - 1][1];
		cache[i][2] = cache[i][2] % DIV;
	}
}

int main()
{
	int ret = 0;
	freopen("input.txt", "r", stdin);
	scanf("%d", &N);
	init();
	process2(N);
	ret = cache[N - 1][0] + cache[N - 1][1] + cache[N - 1][2];
	printf("%d\n", ret % DIV);
}